Revit 2026 API

# MassSurfaceDataIsSlab Property

---

Indicates if a floor is a slab.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSlab { get; }
```
```vb
Public ReadOnly Property IsSlab As Boolean
	Get
```
```cpp
public:
property bool IsSlab {
	bool get ();
}
```
```fsharp
member IsSlab : bool with get
```

#### Property Value

Boolean

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace